903257958/stm32_oop_driver/st7789_spi_hw_dma_touch/driver/lcd.c
/******************************************************************************
 * @brief	初始化LCD
 * @param	dev	:	LCDDev_t 结构体指针
 * @return	0, 表示成功, 其他值表示失败
 ******************************************************************************/
int lcd_init(LCDDev_t *dev)
{
	if (!dev)
		return -1;
	
	/* 保存私有数据 */
	dev->priv_data = (LCDPrivData_t *)malloc(sizeof(LCDPrivData_t));
	if (!dev->priv_data)
		return -1;
	
	LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;
	
	priv_data->spi.info.spix = dev->info.spix;
	priv_data->spi.info.sck_port = dev->info.sck_port;
	priv_data->spi.info.sck_pin = dev->info.sck_pin;
	priv_data->spi.info.mosi_port = dev->info.mosi_port;
	priv_data->spi.info.mosi_pin = dev->info.mosi_pin;
	priv_data->spi.info.miso_port = NULL;
	priv_data->spi.info.miso_pin = NULL;
	priv_data->spi.info.cs_port = dev->info.cs_port;
	priv_data->spi.info.cs_pin = dev->info.cs_pin;
	priv_data->spi.info.prescaler = 2;
	priv_data->spi.info.mode = SPI_MODE_3;

	priv_data->pwm.info.timx = dev->info.timx;
	priv_data->pwm.info.oc_channel = dev->info.oc_channel;
	priv_data->pwm.info.psc = TIMER_FREQ / 1000000 - 1;
	priv_data->pwm.info.arr = 999;
	priv_data->pwm.info.port = dev->info.bl_port;
	priv_data->pwm.info.pin = dev->info.bl_pin;
	
	/* 配置硬件SPI */
	spi_init(&priv_data->spi);
	
	/* 配置时钟与GPIO */
	__lcd_config_gpio_clock_enable(dev->info.res_port);
	__lcd_config_gpio_clock_enable(dev->info.dc_port);
	
	__lcd_config_io_out_pp(dev->info.res_port, dev->info.res_pin);
	__lcd_config_io_out_pp(dev->info.dc_port, dev->info.dc_pin);
	
	__lcd_dc_write(dev, 1);
	__lcd_res_write(dev, 1);
	
	/* 配置背光 */
	pwm_init(&priv_data->pwm);
	priv_data->pwm.set_compare(&priv_data->pwm, 100);
	
	/* 配置LCD */
	__lcd_reset(dev);			// 复位

	__lcd_set_direction(dev);	// 设置屏幕方向

	__lcd_write_command(dev, 0x36);
	if (dev->info.dir == VERTICAL_FORWARD)
		__lcd_write_byte(dev, 0x00);
    else if (dev->info.dir == VERTICAL_REVERSE)
		__lcd_write_byte(dev, 0xC0);
	else if (dev->info.dir == HORIZONTAL_FORWARD)
		__lcd_write_byte(dev, 0x70);
	else if (dev->info.dir == HORIZONTAL_REVERSE)
		__lcd_write_byte(dev, 0xA0);

    __lcd_write_command(dev, 0x3A);
    __lcd_write_byte(dev, 0x05);

    __lcd_write_command(dev, 0xB2);
    __lcd_write_byte(dev, 0x0B);
    __lcd_write_byte(dev, 0x0B);
    __lcd_write_byte(dev, 0x00);
    __lcd_write_byte(dev, 0x33);
    __lcd_write_byte(dev, 0x35);

    __lcd_write_command(dev, 0xB7);
    __lcd_write_byte(dev, 0x11);

    __lcd_write_command(dev, 0xBB);
    __lcd_write_byte(dev, 0x35);

    __lcd_write_command(dev, 0xC0);
    __lcd_write_byte(dev, 0x2C);

    __lcd_write_command(dev, 0xC2);
    __lcd_write_byte(dev, 0x01);

    __lcd_write_command(dev, 0xC3);
    __lcd_write_byte(dev, 0x0D);

    __lcd_write_command(dev, 0xC4);
    __lcd_write_byte(dev, 0x20);

    __lcd_write_command(dev, 0xC6);
    __lcd_write_byte(dev, 0x13);

    __lcd_write_command(dev, 0xD0);
    __lcd_write_byte(dev, 0xA4);
    __lcd_write_byte(dev, 0xA1);

    __lcd_write_command(dev, 0xD6);
    __lcd_write_byte(dev, 0xA1);

    __lcd_write_command(dev, 0xE0);
    __lcd_write_byte(dev, 0xF0);
    __lcd_write_byte(dev, 0x06);
    __lcd_write_byte(dev, 0x0B);
    __lcd_write_byte(dev, 0x0A);
    __lcd_write_byte(dev, 0x09);
    __lcd_write_byte(dev, 0x26);
    __lcd_write_byte(dev, 0x29);
    __lcd_write_byte(dev, 0x33);
    __lcd_write_byte(dev, 0x41);
    __lcd_write_byte(dev, 0x18);
    __lcd_write_byte(dev, 0x16);
    __lcd_write_byte(dev, 0x15);
    __lcd_write_byte(dev, 0x29);
    __lcd_write_byte(dev, 0x2D);

    __lcd_write_command(dev, 0xE1);
    __lcd_write_byte(dev, 0xF0);
    __lcd_write_byte(dev, 0x04);
    __lcd_write_byte(dev, 0x08);
    __lcd_write_byte(dev, 0x08);
    __lcd_write_byte(dev, 0x07);
    __lcd_write_byte(dev, 0x03);
    __lcd_write_byte(dev, 0x28);
    __lcd_write_byte(dev, 0x32);
    __lcd_write_byte(dev, 0x40);
    __lcd_write_byte(dev, 0x3B);
    __lcd_write_byte(dev, 0x19);
    __lcd_write_byte(dev, 0x18);
    __lcd_write_byte(dev, 0x2A);
    __lcd_write_byte(dev, 0x2E);

    __lcd_write_command(dev, 0xE4);
    __lcd_write_byte(dev, 0x25);
    __lcd_write_byte(dev, 0x00);
    __lcd_write_byte(dev, 0x00);

    __lcd_write_command(dev, 0x21);

    __lcd_write_command(dev, 0x11);
    delay_ms(120);
    __lcd_write_command(dev, 0x29);
	
	/* 屏幕初始化为黑色 */
	__lcd_clear(dev, BLACK);
	
	/* 函数指针赋值 */
	dev->backlight_ctrl = __lcd_backlight_ctrl;
	dev->clear = __lcd_clear;
	dev->fill = __lcd_fill;
	dev->color_fill = __lcd_color_fill;
	dev->color_fill_dma = __lcd_color_fill_dma;
	dev->show_char = __lcd_show_char;
	dev->show_string = __lcd_show_string;
	dev->show_num = __lcd_show_num;
	dev->show_hex_num = __lcd_show_hex_num;
	dev->show_float_num = __lcd_show_float_num;
	dev->show_chinese = __lcd_show_chinese;
	dev->show_image = __lcd_show_image;
	dev->draw_point = __lcd_draw_point;
	dev->draw_line = __lcd_draw_line;
	dev->draw_rectangle = __lcd_draw_rectangle;
	dev->draw_circle = __lcd_draw_circle;
	dev->deinit = __lcd_deinit;
	
	dev->init_flag = true;
	return 0;
}

/******************************************************************************
 * @brief	LCD配置DMA传输，用于LVGL
 * @param	dev			:	LCDDev_t 结构体指针
 * @param	mem_base_addr	:	DMA内存地址
 * @return	无
 ******************************************************************************/
void lcd_dma_init(LCDDev_t *dev, uint32_t mem_base_addr)
{
	#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	
	__lcd_config_dma_clock_enable(dev->info.spix);	// 开启DMA时钟
	DMA_DeInit(__lcd_get_dma_channel(dev->info.spix));
	DMA_InitTypeDef DMA_InitStructure;
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&dev->info.spix->DR;	// SPI数据寄存器地址
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)mem_base_addr;			// 内存地址
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;							// 方向：从内存到外设
    DMA_InitStructure.DMA_BufferSize = 0;										// 传输大小
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;			// 外设地址不增
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;						// 内存地址自增
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;		// 外设数据单位8位
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;				// 内存数据单位8位
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;								// 工作在正常模式，一次传输后自动结束
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;						// 优先级：中
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;								// 没有设置为内存到内存传输
    DMA_Init(__lcd_get_dma_channel(dev->info.spix), &DMA_InitStructure);
	
