903257958/stm32_oop_driver/st7789_spi_hw_dma_touch/driver/lcd.c
    DMA_ClearFlag(__lcd_get_dma_flag(dev->info.spix));
	
    DMA_Cmd(__lcd_get_dma_channel(dev->info.spix), DISABLE);
	
	#elif defined(STM32F40_41xxx) || defined(STM32F411xE)
	
    __lcd_config_dma_clock_enable(dev->info.spix);	// 开启DMA时钟
	
	DMA_DeInit(__lcd_get_dma_stream(dev->info.spix));
	DMA_InitTypeDef DMA_InitStructure;
    DMA_InitStructure.DMA_Channel = __lcd_get_dma_channel(dev->info.spix);		// 选择DMA通道
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&dev->info.spix->DR;	// SPI数据寄存器地址
    DMA_InitStructure.DMA_Memory0BaseAddr = (uint32_t)mem_base_addr;			// 内存地址
    DMA_InitStructure.DMA_DIR = DMA_DIR_MemoryToPeripheral;						// 方向：从内存到外设
    DMA_InitStructure.DMA_BufferSize = 0;										// 传输大小
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;			// 外设地址不增
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;						// 内存地址自增
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;		// 外设数据单位8位
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;				// 内存数据单位8位
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;								// 工作在正常模式，一次传输后自动结束
    DMA_InitStructure.DMA_Priority = DMA_Priority_Medium;						// 优先级：中
    DMA_InitStructure.DMA_FIFOMode = DMA_FIFOMode_Disable;						// 禁用FIFO模式
    DMA_InitStructure.DMA_FIFOThreshold = DMA_FIFOThreshold_Full;				// FIFO阈值为满
    DMA_InitStructure.DMA_MemoryBurst = DMA_MemoryBurst_Single;					// 内存突发传输为单次
    DMA_InitStructure.DMA_PeripheralBurst = DMA_PeripheralBurst_Single;			// 外设突发传输为单次
    DMA_Init(__lcd_get_dma_stream(dev->info.spix), &DMA_InitStructure);
	
    DMA_ClearFlag(	__lcd_get_dma_stream(dev->info.spix), 
					__lcd_get_dma_flag(dev->info.spix)	);
					
    DMA_Cmd(__lcd_get_dma_stream(dev->info.spix), DISABLE);
	
	#endif
}

/******************************************************************************
 * @brief	LCD背光控制
 * @param	dev	:	LCDDev_t 结构体指针
 * @param	value	:	背光调节系数，范围：0~100
 * @return	无
 ******************************************************************************/
static void __lcd_backlight_ctrl(struct LCDDev *dev, uint16_t val)
{
	LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;

	uint16_t compare = val * 10;
	if (compare > 1000)
	{
		compare = 1000;
	}
	compare = 1000 - compare;

	priv_data->pwm.set_compare(&priv_data->pwm, compare);
}

/*通信协议*********************************************************************/

/******************************************************************************
 * @brief	LCD写RES高低电平
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	bit_val	:	要写入RES的电平值，范围：0/1
 * @return	无
 ******************************************************************************/
static void __lcd_res_write(LCDDev_t *dev, uint8_t bit_val)
{
	__lcd_io_write(dev->info.res_port, dev->info.res_pin, bit_val);
}

/******************************************************************************
 * @brief	LCD写DC高低电平
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	bit_val	:	要写入DC的电平值，范围：0/1
 * @return	无
 ******************************************************************************/
static void __lcd_dc_write(LCDDev_t *dev, uint8_t bit_val)
{
	__lcd_io_write(dev->info.dc_port, dev->info.dc_pin, bit_val);
}

/******************************************************************************
 * @brief	LCD复位
 * @param	dev	:	LCDDev_t 结构体指针
 * @return	无
 ******************************************************************************/
static void __lcd_reset(LCDDev_t *dev)
{
	__lcd_res_write(dev, 1);
	delay_ms(100);
	__lcd_res_write(dev, 0);
	delay_ms(100);
	__lcd_res_write(dev, 1);
	delay_ms(100);
}

/******************************************************************************
 * @brief	LCD写命令
 * @param	dev	:	LCDDev_t 结构体指针
 * @param	byte	:	要写入的命令值，范围：0x00~0xFF
 * @return	无
 ******************************************************************************/
static void __lcd_write_command(LCDDev_t *dev, uint8_t command)
{
	LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;
	
	__lcd_dc_write(dev, 0);			// 写命令
	priv_data->spi.start(&priv_data->spi);				// 拉低CS，开始通信
	priv_data->spi.swap_byte(&priv_data->spi, command);	// 写入指定命令
	priv_data->spi.stop(&priv_data->spi);					// 拉高CS，结束通信
}

/******************************************************************************
 * @brief	LCD写一个字节数据
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	byte	:	要写入的数据，范围：0x00~0xFF
 * @return	无
 ******************************************************************************/
static void __lcd_write_byte(LCDDev_t *dev, uint8_t byte)
{	
	LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;
	
	__lcd_dc_write(dev, 1);			// 写数据
	priv_data->spi.start(&priv_data->spi);				// 拉低CS，开始通信
	priv_data->spi.swap_byte(&priv_data->spi, byte);		// 写入指定命令
	priv_data->spi.stop(&priv_data->spi);					// 拉高CS，结束通信
}

/******************************************************************************
 * @brief	LCD写一个半字数据
 * @param	dev			:	LCDDev_t 结构体指针
 * @param	halfword	:	要写入的数据，范围：0x0000~0xFFFF
 * @return	无
 ******************************************************************************/
static void __lcd_write_halfword(LCDDev_t *dev, uint16_t halfword)
{
	LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;
	
	__lcd_dc_write(dev, 1);			// 写数据
	priv_data->spi.start(&priv_data->spi);					// 拉低CS，开始通信
	priv_data->spi.swap_byte(&priv_data->spi, halfword >> 8);	// 写入数据
	priv_data->spi.swap_byte(&priv_data->spi, halfword);		// 写入数据
	priv_data->spi.stop(&priv_data->spi);						// 拉高CS，结束通信
}

/**********************************************************************通信协议*/

/*硬件配置**********************************************************************/

/******************************************************************************
 * @brief	LCD设置屏幕方向
 * @param	dev	:	LCDDev_t 结构体指针
 * @return	无
 ******************************************************************************/
static void __lcd_set_direction(LCDDev_t *dev)
{
    uint8_t memoryAccessReg = 0x00;

    if (dev->info.dir == HORIZONTAL_FORWARD || dev->info.dir == HORIZONTAL_REVERSE)
	{
		dev->width = LCD_H;
		dev->height = LCD_W;
        memoryAccessReg = 0X70;
    }
    else if (dev->info.dir == VERTICAL_FORWARD || dev->info.dir == VERTICAL_REVERSE)
	{    
		dev->width = LCD_W;
		dev->height = LCD_H;
        memoryAccessReg = 0X00;
    }

    __lcd_write_command(dev, 0x36);
    __lcd_write_byte(dev, memoryAccessReg);
}

