903257958/stm32_oop_driver/st7789_spi_hw_dma_touch/driver/lcd.c
/******************************************************************************
 * @brief	LCD设置起始和结束地址
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x1,x2	:	设置列的起始和结束地址
 * @param	y1,y2	:	设置行的起始和结束地址
 * @return	无
 ******************************************************************************/
static void __lcd_set_windows(LCDDev_t *dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2)
{
	if (dev->info.dir == VERTICAL_FORWARD || dev->info.dir == VERTICAL_REVERSE)	// 竖屏
	{
		__lcd_write_command(dev, 0x2a);			// 列地址设置
		__lcd_write_halfword(dev, x1);
		__lcd_write_halfword(dev, x2);

		__lcd_write_command(dev, 0x2b);			// 行地址设置
		__lcd_write_halfword(dev, y1 + 20);
		__lcd_write_halfword(dev, y2 + 20);

	}
	else if (dev->info.dir == HORIZONTAL_FORWARD || dev->info.dir == HORIZONTAL_REVERSE)	// 横屏
	{
		__lcd_write_command(dev, 0x2a);			// 列地址设置
		__lcd_write_byte(dev, (x1 + 20) >> 8);
        __lcd_write_byte(dev, x1 + 20);
        __lcd_write_byte(dev, (x2 + 20) >> 8);
        __lcd_write_byte(dev, x2 + 20);

		__lcd_write_command(dev, 0x2b);			// 行地址设置
        __lcd_write_byte(dev, y1 >> 8);
        __lcd_write_byte(dev, y1);
        __lcd_write_byte(dev, (y2) >> 8);
        __lcd_write_byte(dev, y2);
	}

	__lcd_write_command(dev, 0x2c);				// 储存器写 
}

/**********************************************************************硬件配置*/

/*工具函数**********************************************************************/

/******************************************************************************
 * @brief	次方函数
 * @param	x	:	底数
 * @param	y	:	指数
 * @return	x^y
 ******************************************************************************/
static uint32_t __lcd_pow(uint32_t x, uint32_t y)
{
	uint32_t result = 1;	// 结果默认为1
	while (y --)			// 累乘y次
	{
		result *= x;		// 每次把x累乘到结果上
	}
	return result;
}

/**********************************************************************工具函数*/

/*功能函数**********************************************************************/

/******************************************************************************
 * @brief	LCD填充颜色
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	color	:	要填充的颜色
 * @return	无
 ******************************************************************************/
static void __lcd_clear(LCDDev_t *dev, uint16_t color)
{          
	uint16_t i, j;
    
    __lcd_set_windows(dev, 0, 0, dev->width, dev->height);

	__lcd_dc_write(dev, 1);

    for(i = 0; i < LCD_W; i++)
	{
        for(j = 0; j < LCD_H; j++)
		{
			__lcd_write_halfword(dev, color);
        }
     }
}

/******************************************************************************
 * @brief	LCD在指定区域填充颜色
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x,y		:	填充起点
 * @param	width	:	填充的宽度
 * @param	height	:	填充的高度
 * @param	color	:	要填充的颜色
 * @return	无
 ******************************************************************************/
static void __lcd_fill(LCDDev_t *dev, uint16_t x, uint16_t y, uint16_t width, uint16_t height, uint16_t color)
{
	uint16_t i, j;

	__lcd_set_windows(dev, x, y, x + width - 1, y + height - 1);	// 设置显示范围
	for (i = y; i < y + height; i++)
	{													   	 	
		for (j = x; j < x + width; j++)
		{
			__lcd_write_halfword(dev, color);
		}
	}
}

/******************************************************************************
 * @brief	LCD在指定区域填充颜色，用于LVGL
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x1		:	填充起点x坐标
 * @param	y1		:	填充起点y坐标
 * @param	x2		:	填充终点x坐标
 * @param	y2		:	填充终点y坐标
 * @param	color	:	要填充的颜色数组
 * @return	无
 ******************************************************************************/
static void __lcd_color_fill(LCDDev_t *dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t *color)
{
    uint16_t height, width;
    uint16_t i, j;
    width = x2 - x1 + 1;            // 填充的宽度
    height = y2 - y1 + 1;           // 填充的高度

	__lcd_set_windows(dev, x1, y1, x2, y2);					//设置光标位置
	
    for (i = 0; i < height; i++)
    {
        for (j = 0; j < width; j++)
        {
            __lcd_write_halfword(dev, color[i * width + j]);	// 写入数据
        }
    }
}

/******************************************************************************
 * @brief	LCD在指定区域填充颜色，并使用DMA传输，用于LVGL
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x1		:	填充起点x坐标
 * @param	y1		:	填充起点y坐标
 * @param	x2		:	填充终点x坐标
 * @param	y2		:	填充终点y坐标
 * @param	size	:	传输大小
 * @return	无
 ******************************************************************************/
static void __lcd_color_fill_dma(LCDDev_t *dev, uint16_t x1, uint16_t y1, uint16_t x2, uint16_t y2, uint16_t size)
{
	LCDPrivData_t *priv_data = (LCDPrivData_t *)dev->priv_data;
	
	__lcd_set_windows(dev, x1, y1, x2, y2);

	__lcd_dc_write(dev, 1);										// 写数据

	priv_data->spi.start(&priv_data->spi);					// 拉低CS，开始通信
	
	#if defined(STM32F10X_HD) || defined(STM32F10X_MD)
	/* STM32F10X代码待编写 */
	#elif defined(STM32F40_41xxx) || defined(STM32F411xE)
	/* 开启SPI的DMA接收 */
	SPI_I2S_DMACmd(dev->info.spix, SPI_I2S_DMAReq_Tx, ENABLE);

	/* 使能DMA */
	DMA_Cmd(__lcd_get_dma_stream(dev->info.spix), DISABLE);
	while (DMA_GetCmdStatus(__lcd_get_dma_stream(dev->info.spix)) != DISABLE);
	DMA_SetCurrDataCounter(__lcd_get_dma_stream(dev->info.spix), size);
	DMA_Cmd(__lcd_get_dma_stream(dev->info.spix), ENABLE);
	
	/* 等待传输完成 */
	while (DMA_GetFlagStatus(__lcd_get_dma_stream(dev->info.spix),
							 __lcd_get_dma_flag(dev->info.spix)) == RESET);

	/* 清除标志位 */
	DMA_ClearFlag(__lcd_get_dma_stream(dev->info.spix),
				  __lcd_get_dma_flag(dev->info.spix));
	
	priv_data->spi.stop(&priv_data->spi);						// 拉高CS，结束通信
	#endif
}

/******************************************************************************
 * @brief	LCD显示单个字符
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	chr		:	要显示的字符
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	size	:	指定字体大小：LCD_16X32 / LCD_12X24 / LCD_8X16 / LCD_6X12
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_char(LCDDev_t *dev, uint16_t x, uint16_t y, uint8_t chr, uint16_t fc, uint16_t bc, uint8_t size, uint8_t mode)
{
	uint8_t temp, sizex, t, m = 0;
	uint16_t i, TypefaceNum;									// 一个字符所占字节大小
	uint16_t x0 = x;
	sizex = size / 2;
	TypefaceNum = (sizex / 8 + ((sizex % 8) ? 1 : 0)) * size;
	chr = chr - ' ';    								// 得到偏移后的值

	for (i = 0; i < TypefaceNum; i++)
	{ 
		if (size==12)temp=LCD_F6x12[chr][i];			// 调用6x12字体
		else if (size==16)temp=LCD_F8x16[chr][i];		// 调用8x16字体
		else if (size==24)temp=LCD_F12x24[chr][i];		// 调用12x24字体
		else if (size==32)temp=LCD_F16x32[chr][i];		// 调用16x32字体
		else return;

		for (t = 0;t < 8;t++)
		{
			if (!mode)									// 非叠加模式
			{
				if (temp & (0x01 << t)) __lcd_draw_point(dev, x, y, fc);
                else __lcd_draw_point(dev, x, y, bc);
                m++;
                x++;
                if (m % sizex == 0)
                {
                    m = 0;
                    x = x0;
                    y++;
                    break;
                }
			}
			else										// 叠加模式
			{
				if (temp & (0x01 << t)) __lcd_draw_point(dev, x, y, fc);
                x++;
                if ((x - x0) == sizex)
                {
                    x = x0;
                    y++;
                    break;
                }
			}
		}
	}
}

