903257958/stm32_oop_driver/st7789_spi_hw_dma_touch/driver/lcd.c
/******************************************************************************
 * @brief	LCD显示字符串
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	str		:	要显示的字符
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	size	:	指定字体大小：LCD_16X32 / LCD_12X24 / LCD_8X16 / LCD_6X12
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_string(LCDDev_t *dev, uint16_t x, uint16_t y, char *str, uint16_t fc, uint16_t bc, uint8_t size, uint8_t mode)
{         
	while (*str != '\0')
	{       
		__lcd_show_char(dev, x, y, *str, fc, bc, size, mode);
		x += size / 2;
		str++;
	}
}

/******************************************************************************
 * @brief	LCD显示整数变量
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	num		:	要显示整数变量
 * @param	len		:	要显示的位数
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	size	:	指定字体大小：LCD_16X32 / LCD_12X24 / LCD_8X16 / LCD_6X12
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_num(LCDDev_t *dev, uint16_t x, uint16_t y, uint32_t num, uint8_t len, uint16_t fc, uint16_t bc, uint8_t size, uint8_t mode)
{         	
	u8 t, temp;
    u8 enshow = 0;

    for (t = 0; t < len; t++)
    {
        temp = (num / __lcd_pow(10, len - t - 1)) % 10;

        if (enshow == 0 && t < (len - 1))
        {
            if (temp == 0)
            {
                __lcd_show_char(dev, x + (size / 2)*t, y, ' ', fc, bc, size, mode);
                continue;
            }
            else enshow = 1;
        }

        __lcd_show_char(dev, x + (size / 2)*t, y, temp + '0', fc, bc, size, mode);
    }
}

/******************************************************************************
 * @brief	LCD显示十六进制数
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	num		:	指定要显示的数字，范围：0x00000000~0xFFFFFFFF
 * @param	len		:	指定数字的长度，范围：0~8
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	size	:	指定字体大小：LCD_16X32 / LCD_12X24 / LCD_8X16 / LCD_6X12
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_hex_num(LCDDev_t *dev, uint16_t x, uint16_t y, uint32_t num, uint8_t len, uint16_t fc, uint16_t bc, uint8_t size, uint8_t mode)
{
	uint8_t i, singleNumber;

	for (i = 0; i < len; i++)		// 遍历数字的每一位
	{
		/* 以十六进制提取数字的每一位 */
		singleNumber = num / __lcd_pow(16, len - i - 1) % 16;
		
		if (singleNumber < 10)			// 单个数字小于10
		{
			/* 调用__oled_show_char函数，显示此数字 */
			/* + '0' 可将数字转换为字符格式 */
			__lcd_show_char(dev, x + i * size / 2, y, singleNumber + '0', fc, bc, size, mode);
		}
		else							// 单个数字大于10
		{
			/* 调用__oled_show_char函数，显示此数字 */
			/* + 'A' 可将数字转换为从A开始的十六进制字符 */
			__lcd_show_char(dev, x + i * size / 2, y, singleNumber - 10 + 'A', fc, bc, size, mode);
		}
	}
}

/******************************************************************************
 * @brief	LCD显示两位小数变量
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	num		:	要显示整数变量
 * @param	int_len	:	要显示的整数位数
 * @param	fra_len	:	要显示的小数位数
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	size	:	指定字体大小：LCD_16X32 / LCD_12X24 / LCD_8X16 / LCD_6X12
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_float_num(LCDDev_t *dev, uint16_t x, uint16_t y, float num, uint8_t int_len, uint8_t fra_len, uint16_t fc, uint16_t bc, uint8_t size, uint8_t mode)
{
    uint32_t powNum, intNum, fraNum;
	
	if (num < 0)
	{
		__lcd_show_char(dev, x, y, '-', fc, bc, size, mode);	// 显示-号
	}
	
	/* 提取整数部分和小数部分 */
	intNum = num;						// 直接赋值给整型变量，提取整数
	num -= intNum;						// 将Number的整数减掉，防止之后将小数乘到整数时因数过大造成错误
	powNum = __lcd_pow(10, fra_len);		// 根据指定小数的位数，确定乘数
	fraNum = round(num * powNum);		// 将小数乘到整数，同时四舍五入，避免显示误差
	intNum += fraNum / powNum;			// 若四舍五入造成了进位，则需要再加给整数
	
	if (num >= 0)
	{
		__lcd_show_num(dev, x, y, intNum, int_len, fc, bc, size, mode);								// 显示整数部分
		__lcd_show_char(dev, x + (int_len) * size / 2, y, '.', fc, bc, size, mode);					// 显示小数点
		__lcd_show_num(dev, x + (int_len + 1) * size / 2, y, fraNum, fra_len, fc, bc, size, mode);	// 显示小数部分
	}
	else
	{
		num = -num;
		__lcd_show_num(dev, x + size / 2, y, intNum, int_len, fc, bc, size, mode);					// 显示整数部分
		__lcd_show_char(dev, x + (int_len + 1) * size / 2, y, '.', fc, bc, size, mode);				// 显示小数点
		__lcd_show_num(dev, x + (int_len + 2) * size / 2, y, fraNum, fra_len, fc, bc, size, mode);	// 显示小数部分
	}
}

/******************************************************************************
 * @brief	LCD显示单个12x12汉字
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	Chinese	:	要显示的汉字
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_chinese12x12(LCDDev_t *dev, uint16_t x, uint16_t y, char *Chinese, uint16_t fc, uint16_t bc, uint8_t mode)
{
	uint8_t i, j;
	uint16_t k;
	uint16_t ChineseNum = GetChineseNum(12); 					// 汉字数目
	uint16_t TypefaceNum = (12 / 8 + ((12 % 8) ? 1 : 0)) * 12;	// 一个字符所占字节大小
	uint16_t x0 = x;
	
	for (k = 0; k < ChineseNum; k++)
	{
		if ((LCD_CF12x12[k].Index[0] == *(Chinese)) && (LCD_CF12x12[k].Index[1] == *(Chinese + 1)))
		{
			__lcd_set_windows(dev, x, y, x + 12 - 1, y + 12 - 1);
			for (i = 0; i < TypefaceNum; i++)
			{
				for (j = 0; j < 8; j++)
				{
					if (LCD_CF12x12[k].Msk[i] & (0x01 << j))
					__lcd_draw_point(dev, x, y, fc); // 画一个点
					else if (mode == 0)
						__lcd_draw_point(dev, x, y, bc);
					x++;
					if ((x - x0) == 12)
					{
						x = x0;
						y++;
						break;
					}
				}
			}
		}
		continue; // 查找到对应点阵字库立即退出，防止多个汉字重复取模带来影响
	}
}

/******************************************************************************
 * @brief	LCD显示单个16x16汉字
 * @param	dev		:	LCDDev_t 结构体指针
 * @param	x		:	x坐标
 * @param	y		:	y坐标
 * @param	Chinese	:	要显示的汉字
 * @param	fc		:	字的颜色
 * @param	bc		:	字的背景色
 * @param	mode	:	模式：0非叠加/1叠加
 * @return	无
 ******************************************************************************/
static void __lcd_show_chinese16x16(LCDDev_t *dev, uint16_t x, uint16_t y, char *Chinese, uint16_t fc, uint16_t bc, uint8_t mode)
{
	uint8_t i, j;
	uint16_t k;
	uint16_t ChineseNum = GetChineseNum(16); 					// 汉字数目
	uint16_t TypefaceNum = (16 / 8 + ((16 % 8) ? 1 : 0)) * 16;	// 一个字符所占字节大小
	uint16_t x0 = x;
	
	for (k = 0; k < ChineseNum; k++)
	{
		if ((LCD_CF16x16[k].Index[0] == *(Chinese)) && (LCD_CF16x16[k].Index[1] == *(Chinese + 1)))
		{
			__lcd_set_windows(dev, x, y, x + 12 - 1, y + 12 - 1);
			for (i = 0; i < TypefaceNum; i++)
			{
				for (j = 0; j < 8; j++)
				{
					if (LCD_CF16x16[k].Msk[i] & (0x01 << j))
						__lcd_draw_point(dev, x, y, fc); // 画一个点
					else if (mode == 0)
						__lcd_draw_point(dev, x, y, bc);
					x++;
					if ((x - x0) == 16)
					{
						x = x0;
						y++;
						break;
					}
				}
			}
		}
		continue; // 查找到对应点阵字库立即退出，防止多个汉字重复取模带来影响
	}
}

